posts/2015-01-13-the-fifth-sunday-after-pentecost.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: The Fifth Sunday After Pentecost

Another thought-provoking sermon at [[http://northhavenchurch.net][NorthHaven]] this week - this time, from Bryan Partridge.\\

Here is the prayer for the week:


A good actor devotes herself to her role,\\
and carefully learns her lines;\\
while constantly studying the finest\\
performances of the past.\\
\\
At first, after many missed cues\\
and fumbled lines,\\
she fears she may never get it right.\\
\\
But with wise direction,\\
and hours of rehearsing,\\
every word,\\
and every gesture,\\
eventually seems natural,\\
as if she has finally become\\
what she was always meant to be.\\
\\
And the role,\\
performed countless times by others,\\
is now hers,\\
something new,\\
and beautiful -\\
\\
A work of art\\
taken to the stage,\\
and performed for the pleasure\\
of the audience.\\
\\
\\
Father,\\
\\
We place ourselves\\
under your direction,\\
as we seek to grow\\
into this role,\\
which you have given us -\\
to be disciples of Christ.\\
\\
And with time,\\
may we each create something\\
unique and beautiful\\
for your good pleasure.\\

/Amen/


#+begin_tagline
Tagged: prayer
#+end_tagline
