docs/posts/2015-01-13-the-fifth-sunday-after-pentecost.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Fifth Sunday After Pentecost</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Fifth Sunday After Pentecost</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
Another thought-provoking sermon at <a href="http://northhavenchurch.net">NorthHaven</a> this week - this time, from Bryan Partridge.<br>
</p>

<p>
Here is the prayer for the week:
</p>


<p>
A good actor devotes herself to her role,<br>
and carefully learns her lines;<br>
while constantly studying the finest<br>
performances of the past.<br>
<br>
At first, after many missed cues<br>
and fumbled lines,<br>
she fears she may never get it right.<br>
<br>
But with wise direction,<br>
and hours of rehearsing,<br>
every word,<br>
and every gesture,<br>
eventually seems natural,<br>
as if she has finally become<br>
what she was always meant to be.<br>
<br>
And the role,<br>
performed countless times by others,<br>
is now hers,<br>
something new,<br>
and beautiful -<br>
<br>
A work of art<br>
taken to the stage,<br>
and performed for the pleasure<br>
of the audience.<br>
<br>
<br>
Father,<br>
<br>
We place ourselves<br>
under your direction,<br>
as we seek to grow<br>
into this role,<br>
which you have given us -<br>
to be disciples of Christ.<br>
<br>
And with time,<br>
may we each create something<br>
unique and beautiful<br>
for your good pleasure.<br>
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
